openfoam/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dynamicFvMesh       dynamicOversetFvMesh;


motionSolver solidBodyDisplacementLaplacianMultiZone;

solidBodyDisplacementLaplacianMultiZoneCoeffs
{
	diffusivity uniform 1;
	frozenPointsZone c0ptsZone;
}





// ************************************************************************* //
